# **Importing the necessary Packeages**

---

In [ ]:
import pandas as pd

# **Main dataframe to collect all data**

---

In [ ]:
table_from_html = pd.read_html("https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors")
df = table_from_html[0].copy()
df.columns = ["Rank", "Major", "Type", "EarlyCareerPay", "MidCareerPay", "HighMeaning"]
print(df)

       Rank  ...         HighMeaning
0    Rank:1  ...  % High Meaning:69%
1    Rank:2  ...  % High Meaning:46%
2    Rank:3  ...  % High Meaning:67%
3    Rank:3  ...  % High Meaning:52%
4    Rank:5  ...  % High Meaning:49%
5    Rank:6  ...  % High Meaning:60%
6    Rank:7  ...  % High Meaning:55%
7    Rank:8  ...  % High Meaning:79%
8    Rank:9  ...  % High Meaning:60%
9   Rank:10  ...  % High Meaning:54%
10  Rank:11  ...  % High Meaning:67%
11  Rank:12  ...  % High Meaning:50%
12  Rank:13  ...    % High Meaning:-
13  Rank:14  ...  % High Meaning:56%
14  Rank:15  ...  % High Meaning:42%
15  Rank:16  ...  % High Meaning:60%
16  Rank:17  ...  % High Meaning:64%
17  Rank:18  ...  % High Meaning:31%
18  Rank:18  ...  % High Meaning:34%
19  Rank:20  ...  % High Meaning:64%
20  Rank:21  ...  % High Meaning:49%
21  Rank:22  ...  % High Meaning:63%
22  Rank:23  ...  % High Meaning:44%
23  Rank:24  ...  % High Meaning:57%
24  Rank:25  ...  % High Meaning:49%

[25 rows x 6 columns]

# **Add tables from other pages to main dataframe**

---

In [ ]:
for page_no in range(2, 35):
    table_from_html = pd.read_html(f"https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/{page_no}")
    page_df = table_from_html[0].copy()
    page_df.columns = ["Rank", "Major", "Type", "EarlyCareerPay", "MidCareerPay", "HighMeaning"]
    df = df.append(page_df, ignore_index=True)

# **Select necessary columns only**

---

In [ ]:
df = df[["Major", "EarlyCareerPay", "MidCareerPay"]]
print(df)

                                                Major  ...             MidCareerPay
0                         Major:Petroleum Engineering  ...  Mid-Career Pay:$182,000
1   Major:Electrical Engineering & Computer Scienc...  ...  Mid-Career Pay:$152,300
2              Major:Applied Economics and Management  ...  Mid-Career Pay:$139,600
3                           Major:Operations Research  ...  Mid-Career Pay:$139,600
4                             Major:Public Accounting  ...  Mid-Career Pay:$138,800
5   Major:Chemical Engineering/Materials Science &...  ...  Mid-Career Pay:$137,800
6                Major:Quantitative Business Analysis  ...  Mid-Career Pay:$136,200
7                                      Major:Pharmacy  ...  Mid-Career Pay:$133,200
8                    Major:Aeronautics & Astronautics  ...  Mid-Career Pay:$133,100
9                           Major:Systems Engineering  ...  Mid-Career Pay:$132,900
10                 Major:Electrical Power Engineering  ...  Mid-Career Pay:$130,700
11                        Major:Actuarial Mathematics  ...  Mid-Career Pay:$130,500
12                            Major:Aerospace Studies  ...  Mid-Career Pay:$130,300
13                         Major:Chemical Engineering  ...  Mid-Career Pay:$128,900
14                            Major:Actuarial Science  ...  Mid-Career Pay:$128,700
15               Major:Information & Computer Science  ...  Mid-Career Pay:$127,600
16                     Major:Aeronautical Engineering  ...  Mid-Career Pay:$125,900
17  Major:Operations & Information Systems Management  ...  Mid-Career Pay:$125,100
18                            Major:Political Economy  ...  Mid-Career Pay:$125,100
19                           Major:Marine Engineering  ...  Mid-Career Pay:$125,000
20                 Major:Computer Systems Engineering  ...  Mid-Career Pay:$124,800
21                          Major:Nuclear Engineering  ...  Mid-Career Pay:$124,500
22          Major:Computer Science (CS) & Engineering  ...  Mid-Career Pay:$124,000
23               Major:Corporate Accounting & Finance  ...  Mid-Career Pay:$123,600
24      Major:Electrical & Computer Engineering (ECE)  ...  Mid-Career Pay:$123,300

[25 rows x 3 columns]

# **Clean columns**

---

In [ ]:
df.replace({"^Major:": "", "^Early Career Pay:\$": "", "^Mid-Career Pay:\$": "", ",": ""}, regex=True, inplace=True)

# **Change datatype of numeric columns**

---

In [ ]:
df[["EarlyCareerPay", "MidCareerPay"]] = df[["EarlyCareerPay", "MidCareerPay"]].apply(pd.to_numeric)

# **Minimum and Maximum Salary in Early Career**

---

In [ ]:
df.nlargest(5, "EarlyCareerPay")

                                               Major  ...  MidCareerPay
1   Electrical Engineering & Computer Science (EECS)  ...        152300
74                       Physician Assistant Studies  ...        112200
0                              Petroleum Engineering  ...        182000
49                         Metallurgical Engineering  ...        117700
3                                Operations Research  ...        139600

[5 rows x 3 columns]

In [ ]:
df.nsmallest(5, "EarlyCareerPay")

                        Major  EarlyCareerPay  MidCareerPay
707  Developmental Psychology           31000         62000
571    Painting & Printmaking           32800         71100
814             Voice & Opera           32900         50800
785   Rehabilitation Services           34100         55700
828    Child & Family Studies           34100         43600

#**Maximum and Minimum Salary in Mid Career**

---

In [ ]:
df.nlargest(5, "MidCareerPay")

                                              Major  ...  MidCareerPay
0                             Petroleum Engineering  ...        182000
1  Electrical Engineering & Computer Science (EECS)  ...        152300
2                  Applied Economics and Management  ...        139600
3                               Operations Research  ...        139600
4                                 Public Accounting  ...        138800

[5 rows x 3 columns]

In [ ]:
df.nsmallest(5, "MidCareerPay")

                         Major  EarlyCareerPay  MidCareerPay
833              Metalsmithing           38300         38400
832      Addictions Counseling           38800         42200
831          Medical Assisting           35100         42300
830              Mental Health           35200         42500
829  Early Childhood Education           34100         43300